SELECT uid,mid,blog_content FROM HDATA.weibo_content
WHERE 
blog_time LIKE '%2015-06-29%'
AND
REGEXP_LIKE(blog_content, 

  '((
a股|ceo|facebook|丁鹏|万亿|三大|下跌|严重|个股|中国|中期|主席|买入|事件|交易|产能|人才|亿元|仓位|价值|价格|任何|企业|作者|依赖|信心|信息|做空|入市|全球|公司|公开|关注|冲突|出来|分析|刚刚|创业|创造|利好|利润|券商|力度|势力|协议|博文|危机|即将|历史|原因|双降|反弹|反转|发展|发布|发行|发表|变成|咨询|因为|因素|国内|国外|国际|地产|基本|基础|基金|境外|增加|士气|外资|多少|大妈|大涨|大盘|天冷|央行|失败|头条|奇迹|媒体|存在|季度|完了|宣布|对比|小米|就像|屁股|崩盘|市场|希望|希腊|带来|平台|幸福|应该|应验|建议|开发|开始|开放|开盘|当归|影响|彻底|心热|必须|忽略|态度|思维|恐慌|悉尼|情况|感受|感觉|成为|战争|才能|执行|扩容|技术|抄底|投资|护盘|报道|持续|持股|指数|接盘|接近|控制|推动|提到|操作|收入|收益|收盘|改革|政府|政策|救市|教授|散户|文章|新浪|新股|新闻|方式|无法|明显|暂停|暴涨|暴跌|服务|期待|期指|期货|本来|机构|杠杆|来自|板块|板桥|根据|根本|楚辞|概率|正常|毫无|汇总|汇金|沪指|沪深|泡沫|波动|洗礼|流失|涨停|混沌|港股|游戏|炒股|烈酒|熊市|牛市|王盛|玩玩|现在|理财|甜馨|生病|由于|疯涨|百姓|监管|盘中|目前|看到|看好|看来|石油|离场|窑子|策略|管理|精选|经历|经济|结果|结算|绝对|继续|维持|缺乏|缺口|美元|美国|美股|老婆|老板|老歌|而且|肖钢|股东|股价|股份|股市|股民|股灾|股票|胆量|背景|蒸发|融资|行业|行为|行情|记得|证券|评论|说明|调整|谎言|貌似|财经|资产|资本|资讯|赌场|赚钱|走势|超级|跌停|跌幅|达成|过程|进入|进去|进行|远离|都是|配资|里面|重视|金融|银行|阳痿|阴险|降低|降息|陶永|随着|集团|需要|震荡|非常|靠着|预期|预言|风险|香港|高位|高度|高潮|高管|魔都|中国a股|交易所|仙人跳|公信力|养老金|分析师|创业板|华尔街|印花税|市盈率|强心剂|投资者|换手率|新三板|比特币|流动性|港股通|理财师|经手费|证监会|跌停板|页岩油|上市公司|不利因素|不可抗力|中国股市|中国重汽|交易结算|价值投资|光大证券|兴业证券|基础知识|有限公司|社交游戏|股价暴跌|股指期货|股票分析|股票咨询|股票教程|股票期权|股票资讯|量化投资

) *){3,}')

AND
mid>(SELECT max(mid) FROM HDATA.weibo_content ) *RANDOM()
LIMIT 1000        
;
 
